benchmarkingExperiments/data/16t16c1000rpsLambda.out
Running 60m test @ https://h0fx1aj2m8.execute-api.ap-south-1.amazonaws.com/Prod/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 2103.779ms, rate sampling interval: 5165ms
  Thread calibration: mean lat.: 2275.494ms, rate sampling interval: 5451ms
  Thread calibration: mean lat.: 2147.369ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1903.738ms, rate sampling interval: 4497ms
  Thread calibration: mean lat.: 2129.394ms, rate sampling interval: 5062ms
  Thread calibration: mean lat.: 2198.805ms, rate sampling interval: 5525ms
  Thread calibration: mean lat.: 2066.596ms, rate sampling interval: 4997ms
  Thread calibration: mean lat.: 2100.386ms, rate sampling interval: 5144ms
  Thread calibration: mean lat.: 2163.420ms, rate sampling interval: 5136ms
  Thread calibration: mean lat.: 2353.907ms, rate sampling interval: 5742ms
  Thread calibration: mean lat.: 2407.119ms, rate sampling interval: 5791ms
  Thread calibration: mean lat.: 2329.062ms, rate sampling interval: 5435ms
  Thread calibration: mean lat.: 2158.566ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 2295.775ms, rate sampling interval: 5533ms
  Thread calibration: mean lat.: 2357.353ms, rate sampling interval: 5722ms
  Thread calibration: mean lat.: 2223.913ms, rate sampling interval: 5464ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.02m     2.34m    8.22m    57.88%
    Req/Sec    53.55      2.26    58.00     88.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.02m 
 75.000%    6.00m 
 90.000%    7.28m 
 99.000%    8.07m 
 99.900%    8.17m 
 99.990%    8.21m 
 99.999%    8.22m 
100.000%    8.22m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2340.863     0.000000            1         1.00
   46432.255     0.100000       310461         1.11
   94830.591     0.200000       620965         1.25
  142999.551     0.300000       931365         1.43
  194641.919     0.400000      1241875         1.67
  241434.623     0.500000      1552688         2.00
  263454.719     0.550000      1707619         2.22
  287309.823     0.600000      1863701         2.50
  311951.359     0.650000      2019261         2.86
  337379.327     0.700000      2173218         3.33
  360185.855     0.750000      2329066         4.00
  372506.623     0.775000      2405838         4.44
  385613.823     0.800000      2484633         5.00
  398196.735     0.825000      2562094         5.71
  409731.071     0.850000      2638684         6.67
  423100.415     0.875000      2716793         8.00
  430178.303     0.887500      2755047         8.89
  436994.047     0.900000      2795070        10.00
  443809.791     0.912500      2832582        11.43
  451674.111     0.925000      2871703        13.33
  458227.711     0.937500      2911186        16.00
  461373.439     0.943750      2930175        17.78
  464519.167     0.950000      2949133        20.00
  467664.895     0.956250      2969731        22.86
  470810.623     0.962500      2989229        26.67
  473956.351     0.968750      3007838        32.00
  475529.215     0.971875      3017306        35.56
  477102.079     0.975000      3026646        40.00
  478674.943     0.978125      3036482        45.71
  480247.807     0.981250      3047403        53.33
  481558.527     0.984375      3055789        64.00
  482344.959     0.985938      3061199        71.11
  483131.391     0.987500      3066148        80.00
  483917.823     0.989062      3071453        91.43
  484442.111     0.990625      3074967       106.67
  485228.543     0.992188      3079974       128.00
  485752.831     0.992969      3083370       142.22
  486014.975     0.993750      3084658       160.00
  486539.263     0.994531      3087243       182.86
  487063.551     0.995313      3089778       213.33
  487587.839     0.996094      3092409       256.00
  487849.983     0.996484      3093712       284.44
  488112.127     0.996875      3094944       320.00
  488374.271     0.997266      3095923       365.71
  488636.415     0.997656      3096805       426.67
  489160.703     0.998047      3098649       512.00
  489160.703     0.998242      3098649       568.89
  489422.847     0.998437      3099614       640.00
  489684.991     0.998633      3100412       731.43
  489947.135     0.998828      3101042       853.33
  489947.135     0.999023      3101042      1024.00
  490209.279     0.999121      3101644      1137.78
  490209.279     0.999219      3101644      1280.00
  490471.423     0.999316      3102246      1462.86
  490471.423     0.999414      3102246      1706.67
  490733.567     0.999512      3102681      2048.00
  490995.711     0.999561      3102969      2275.56
  490995.711     0.999609      3102969      2560.00
  491257.855     0.999658      3103266      2925.71
  491257.855     0.999707      3103266      3413.33
  491519.999     0.999756      3103520      4096.00
  491519.999     0.999780      3103520      4551.11
  491519.999     0.999805      3103520      5120.00
  491782.143     0.999829      3103655      5851.43
  491782.143     0.999854      3103655      6826.67
  492044.287     0.999878      3103725      8192.00
  492044.287     0.999890      3103725      9102.22
  492306.431     0.999902      3103822     10240.00
  492306.431     0.999915      3103822     11702.86
  492568.575     0.999927      3103914     13653.33
  492568.575     0.999939      3103914     16384.00
  492568.575     0.999945      3103914     18204.44
  492568.575     0.999951      3103914     20480.00
  492830.719     0.999957      3103962     23405.71
  492830.719     0.999963      3103962     27306.67
  492830.719     0.999969      3103962     32768.00
  493092.863     0.999973      3104033     36408.89
  493092.863     0.999976      3104033     40960.00
  493092.863     0.999979      3104033     46811.43
  493092.863     0.999982      3104033     54613.33
  493092.863     0.999985      3104033     65536.00
  493092.863     0.999986      3104033     72817.78
  493092.863     0.999988      3104033     81920.00
  493092.863     0.999989      3104033     93622.86
  493092.863     0.999991      3104033    109226.67
  493092.863     0.999992      3104033    131072.00
  493355.007     0.999993      3104055    145635.56
  493355.007     1.000000      3104055          inf
#[Mean    =   241323.500, StdDeviation   =   140271.454]
#[Max     =   493092.864, Total count    =      3104055]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3111327 requests in 60.00m, 1.48GB read
Requests/sec:    864.25
Transfer/sec:    430.44KB